export const governmentPageSidebarData = [
  {
    title: "سياسة الاحتفاظ بالوثائق وإتلافها",
    url: "/govern/docs-policy",
  },
  {
    title: "قرار التملك والاستثمار",
    url: "/govern/invest-decision",
  },
  {
    title: "دليل الحوكمة",
    url: "/govern/govern-guide",
  },
  {
    title: "الاحتفاظ بالوثائق وإتلافها",
    url: "/govern/docs-preserve",
  },
]

export const boardOfDirectors = [
  {
    name: "المستشار خالد أحمد عبود الزهيري",
    title: "رئيس المجلس",
  },
  {
    name: "الأستاذ محمد خلف بخيت الغامدي",
    title: "نائب الرئيس",
  },
  {
    name: "الدكتور إبراهيم رافع إبراهيم الغامدي",
    title: "عضو مجلس الادارة",
  },
  {
    name: "الدكتور عوض محمد خليل بن مرضاح",
    title: "عضو مجلس الادارة",
  },
  {
    name: "المهندس عمر حسين محمد عباس",
    title: "عضو مجلس الادارة",
  },
]

export const generalAssemblyMembers = [
  {
    name: "الأستاذ نسيم محمد حمزة المدني",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الأستاذ صالح محسن مصلح المحمادي",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الأستاذ محمود عبد الله سليمان السليماني",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الأستاذ يحيى محمد عبد الله باحشوان",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الأستاذ سامي إبراهيم نافع الأحمدي",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الدكتور أنس عبد الوهاب عبد الله زرعه",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "لأستاذ عبد الله أحمد عبد الله الغامدي",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الدكتور عثمان عطيه الله محمد المزمومي",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الدكتور عمر سعيد محمد آل مبطي",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الدكتور مسعود محمد حسين القحطاني",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الأستاذ علي محمد عطيه الغامدي",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الدكتور ماجد حاتم حامد الحارثي",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الأستاذ محمد عيسى محمد فلاته",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الدكتور خالد محمد سالم بابطين",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الدكتور رأفت محمد علي الحديبي",
    title: "عضو الحمعية العمومية",
  },
  {
    name: "الدكتور سالم علي شبنان الغامدي",
    title: "عضو الحمعية العمومية",
  },
]

export const news = [
  {
    title: "ورش العمل الجديدة 🎓",
    description:
      "انضموا إلينا في سلسلة ورش عمل مخصصة لدعم التواصل الأسري والتعامل مع التحديات اليومية.",
    metadata:
      "🌟 عنوان الورشة: التواصل الفعّال بين أفراد الأسرة 🗓️ التاريخ: بداية من [تحديد تاريخ]📍 المكان: [الموقع أو خيار الحضور عن بُعد عبر الإنترنت] 🎟️  التسجيل: المقاعد محدودة، يُرجى التسجيل مسبقًا لضمان الحضور",
    imgSrc: "/images/news-img.png",
  },
  {
    title: "ورش العمل الجديدة 🎓",
    description:
      "انضموا إلينا في سلسلة ورش عمل مخصصة لدعم التواصل الأسري والتعامل مع التحديات اليومية.",
    metadata:
      "🌟 عنوان الورشة: التواصل الفعّال بين أفراد الأسرة 🗓️ التاريخ: بداية من [تحديد تاريخ]📍 المكان: [الموقع أو خيار الحضور عن بُعد عبر الإنترنت] 🎟️  التسجيل: المقاعد محدودة، يُرجى التسجيل مسبقًا لضمان الحضور",
    imgSrc: "/images/news-img.png",
  },
  {
    title: "ورش العمل الجديدة 🎓",
    description:
      "انضموا إلينا في سلسلة ورش عمل مخصصة لدعم التواصل الأسري والتعامل مع التحديات اليومية.",
    metadata:
      "🌟 عنوان الورشة: التواصل الفعّال بين أفراد الأسرة 🗓️ التاريخ: بداية من [تحديد تاريخ]📍 المكان: [الموقع أو خيار الحضور عن بُعد عبر الإنترنت] 🎟️  التسجيل: المقاعد محدودة، يُرجى التسجيل مسبقًا لضمان الحضور",
    imgSrc: "/images/news-img.png",
  },
]

export const projects = [
  {
    title: "و الصلح خير",
    image: "/images/solh.avif",
    reached: "0",
    target: "10,000",
    percentage: 0,
    desc: "ساهم معنا في الصلح بين الزوجين ، للمحافظة على الأسرة وترابطها قال صلى الله عليه وسلم (ألا أخبرُكم بأفضلَ من درجةِ الصيامِ والصلاةِ والصدقةِ قالوا: بلى، قال: إصلاحُ ذاتِ البينِ..) صححه الالباني. ",
    link: "https://almsarra.com/products/%D9%88%D8%A7%D9%84%D8%B5%D9%84%D9%80%D9%80%D9%80%D9%80%D9%80%D9%80%D8%AD-%D8%AE%D9%8A%D9%80%D9%80%D9%80%D9%80%D9%80%D9%80%D8%B1",
  },
  {
    title: "وقف المسرة الاول",
    image: "/images/agr.avif",
    reached: "0",
    target: "10,000",
    percentage: 0,
    desc: "ساهم معنا في انشاء وبناء وقف المسرة الأول بمساهمتك تفوز بأجر دائم ومستمر لا ينقطع",
    link: "https://almsarra.com/products/%D9%88%D9%82%D9%80%D9%80%D9%80%D9%80%D9%80%D9%80%D9%81-%D8%A7%D9%84%D9%85%D8%B3%D9%80%D9%80%D9%80%D9%80%D9%80%D9%80%D8%B1%D8%A9-%D8%A7%D9%84%D8%A3%D9%88%D9%84",
  },
  {
    title: "أسعد اسرة",
    image: "/images/asiad.avif",
    reached: "0",
    target: "10,000",
    percentage: 0,
    desc: "ساهم معنا في بناء وتأهيل ١٠ ألاف أسرة بوسائل حديثة ومبتكرة للوصل بهم الى الاستقرار والهناء الاسري ",
    link: "https://almsarra.com/products/%D8%A3%D8%B3%D8%B9%D8%AF-%D8%A3%D8%B3%D8%B1%D8%A9",
  },
]

export const dashboardPages = {
  dashboard: "أخر الأخبار",
  contact: "تواصل معنا",
  govern: "الحوكمة",
}

export const dashboardNavLinks = [
  {
    href: "/dashboard",
    text: dashboardPages.dashboard,
    icon: "/icons/lamp.svg",
  },
  {
    href: "/dashboard/govern",
    text: dashboardPages.govern,
    icon: "/icons/govern.svg",
  },
  {
    href: "/dashboard/contact",
    text: dashboardPages.contact,
    icon: "/icons/Message.svg",
  },
]

export const events = [
  {
    title: "الحدث الأول",
    description: "هذا هو وصف الحدث الأول.",
    image: "/images/event.png",
    date: "2024-12-20",
    link: "https://example.com/event1",
    isShown: true,
  },
  {
    title: "الحدث الثاني",
    description: "هذا هو وصف الحدث الثاني.",
    image: "/images/event.png",
    date: "2024-12-25",
    link: "https://example.com/event2",
    isShown: true,
  },
  {
    title: "الحدث الثالث",
    description: "هذا هو وصف الحدث الثالث.",
    image: "/images/event.png",
    date: "2025-01-10",
    link: "https://example.com/event3",
    isShown: true,
  },
  {
    title: "الحدث الرابع",
    description: "هذا هو وصف الحدث الرابع.",
    image: "/images/event.png",
    date: "2025-02-15",
    link: "https://example.com/event4",
    isShown: false,
  },
  {
    title: "الحدث الخامس",
    description: "هذا هو وصف الحدث الخامس.",
    image: "/images/event.png",
    date: "2025-03-20",
    link: "https://example.com/event5",
    isShown: true,
  },
]

export const messages = [
  {
    id: 1,
    name: "جون دو", // John Doe in Arabic
    email: "john.doe@example.com",
    phone: "555-1234",
    date: "2024-11-20",
    text: "هذه هي الرسالة الأولى.", // This is the first message in Arabic
  },
  {
    id: 2,
    name: "جين سميث", // Jane Smith in Arabic
    email: "jane.smith@example.com",
    phone: "555-5678",
    date: "2024-11-21",
    text: "هذه هي الرسالة الثانية.", // This is the second message in Arabic
  },
  {
    id: 3,
    name: "ديفيد لي", // David Lee in Arabic
    email: "david.lee@example.com",
    phone: "555-9012",
    date: "2024-11-22",
    text: "هذه هي الرسالة الثالثة.", // This is the third message in Arabic
  },
  {
    id: 4,
    name: "سارة جونز", // Sarah Jones in Arabic
    email: "sarah.jones@example.com",
    phone: "555-3456",
    date: "2024-11-23",
    text: "هذه هي الرسالة الرابعة.", // This is the fourth message in Arabic
  },
  {
    id: 5,
    name: "مايكل براون", // Michael Brown in Arabic
    email: "michael.brown@example.com",
    phone: "555-7890",
    date: "2024-11-24",
    text: "هذه هي الرسالة الخامسة.", // This is the fifth message in Arabic
  },
]

export const URL_REGEX =
  /^(https?:\/\/)?((([a-z\d]([a-z\d-]*[a-z\d])*)\.)+[a-z]{2,}|((\d{1,3}\.){3}\d{1,3}))(\:\d+)?(\/[-a-z\d%_.~+]*)*(\?[;&a-z\d%_.~+=-]*)?(\#[-a-z\d_]*)?$/

export const EMAIL_REGEX = /^[\w-]+(\.[\w-]+)*@([\w-]+\.)+[a-zA-Z]{2,7}$/

export const ourValues = [
  {
    title: "الرســـــالة",
    description:
      "جمعية متخصصة في بناء الأسر الناشئة وتعزيز مكانتها واستقرارها من خلال مبادرات نوعية مبتكرة.",
    icon: "/icons/top-rated.svg",
  },
  {
    title: "الرؤيــــــــة",
    description: " المستشـــــــــــار الأول للأسر الناشئة.",
    icon: "/icons/rocket.svg",
  },
  {
    title: "الاتقان",
    description:
      "نحرص على تقديم خدماتنا بأعلى معايير الجودة والإتقان، لضمان تحقيق أفضل نتائج ممكنة للأسر والمتزوجين الذين نعتمد عليهم.",
    icon: "/icons/top-rated.svg",
  },
  {
    title: "الالتزام",
    description:
      "التزامنا بخدمة المجتمع وتحقيق الأثر الإيجابي هو حجر الأساس في عملنا. نعمل بجد لضمان الوفاء بتعهداتنا تجاه من هم في حاجة.",
    icon: "/icons/check.svg",
  },
  {
    title: "الموثوقية",
    description:
      "نلتزم بالشفافية والمصداقية في كل تعاملاتنا، ونسعى دائمًا لأن نكون الجهة التي يمكن الاعتماد عليها لتقديم الدعم الفعّال.",
    icon: "/icons/award.svg",
  },
  {
    title: "سرعة الوصول",
    description:
      "نؤمن بأن المساعدة في الوقت المناسب قد تغير حياة كاملة، ولهذا نضمن سرعة الاستجابة وتوصيل الدعم لمستحقيه بأسرع وقت.",
    icon: "/icons/rocket.svg",
  },
  {
    title: "استدامة العلاقة مع العميل",
    description:
      "نحرص على بناء علاقات طويلة الأمد مع عملائنا والمستفيدين، مبنية على الثقة والتواصل المستمر لضمان تلبية احتياجاتهم دائماً.",
    icon: "/icons/customer.svg",
  },
]
